#!/bin/bash

echo "======================================"
echo "          Системная информация         "
echo "======================================"
echo "Дата и время: $(date)"
echo "Имя хоста: $(hostname)"
echo "Версия ОС: $(lsb_release -d | cut -f2)"
echo "Аптайм: $(uptime -p)"
echo "Загруженность системы: $(uptime | awk -F'load average:' '{ print $2 }')"
echo "Пользователи в системе: $(who | wc -l)"
echo

echo "======================================"
echo "             Использование CPU         "
echo "======================================"
mpstat | awk '$12 ~ /[0-9.]+/ { print 100 - $12"%"}'
echo

echo "======================================"
echo "            Использование памяти       "
echo "======================================"
free -h | awk '/^Mem:/ { print "Использовано: " $3 " / " $2 " (" $3/$2*100 "%)"}'
echo

echo "======================================"
echo "            Использование диска        "
echo "======================================"
df -h / | awk 'NR==2 { print "Использовано: " $3 " / " $2 " (" $5 ")"}'
echo

echo "======================================"
echo "     Топ 5 процессов по использованию CPU"
echo "======================================"
ps -eo pid,comm,%cpu --sort=-%cpu | head -n 6
echo

echo "======================================"
echo "    Топ 5 процессов по использованию памяти"
echo "======================================"
ps -eo pid,comm,%mem --sort=-%mem | head -n 6

